tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions" # for docker-edge
tap "potatolabs/git-redate"

# A CLI tool upgrading every outdated app installed by Homebrew Cask
# INFO: brew cu
tap 'buo/cask-upgrade'

# Brews
brew "asciinema"
brew "awscli"
brew "bash"
brew "bat"
brew "coreutils" # Those that come with macOS are outdated
brew "curl"
brew "docker-compose"
# brew "doctl"
# brew "dockutil" # HOMEBREW DOCKUTIL DOES NOT WORK, MANUALLY INSTALL RELEASE FROM GITHUB
brew "dive"
brew "ffmpeg"
brew "gnu-sed", with_default_names: true
brew "grep"
# brew "helm"
brew "httpie"
brew "jq" # to pipe pretty json output from bash
brew "kubernetes-cli"
# brew "mackup"
brew "masscan"
brew "minikube"
brew "ncdu"
brew "libpq" # for postgres gem
# brew "lynx" # cli web browser
# brew "postgres"
brew "restic"
brew "rsync"
brew "overmind"
brew "safe-rm"
brew "smartmontools"
brew "stow"
brew "the_silver_searcher" # https://gist.github.com/indiesquidge/ec010eca3ffa254788c2#brew-install-the_silver_searcher
brew "telnet"
brew "terraform"
brew "trash"
brew "tree"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zsh"

# git stuff
brew "git"
brew "git-lfs"
brew "git-extras"
brew "diff-so-fancy"
brew "difftastic"
brew "gh"
brew "hub"
brew "potatolabs/git-redate/git-redate"

# Image
brew "advancecomp"
brew "apngasm"
brew "exiftool"
brew "gifsicle"
brew "graphicsmagick"
brew "guetzli"
brew "icoutils"
brew "imagemagick"
brew "imageworsener"
brew "jhead"
brew "jpeg"
brew "jpeg-archive"
brew "jpegoptim"
brew "jpegrescan"
brew "libbpg"
brew "mozjpeg"
brew "optipng"
brew "perceptualdiff"
brew "pngcheck"
brew "pngcrush"
brew "pngnq"
brew "pngquant"
brew "webp"

brew "pigz"
brew "zopfli"

# asdf php
brew "autoconf"
brew "automake"
brew "bison"
brew "freetype"
brew "gd"
brew "gettext"
brew "icu4c"
brew "krb5"
brew "libedit"
brew "libiconv"
brew "libjpeg"
brew "libpng"
brew "libxml2"
brew "libzip"
brew "pkg-config"
brew "re2c"
brew "zlib"
brew "gmp" 
brew "libsodium" 
brew "imagemagick"
