tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions" # for docker-edge
tap "potatolabs/git-redate"

# A CLI tool upgrading every outdated app installed by Homebrew Cask
# INFO: brew cu
tap 'buo/cask-upgrade'

# Brews
brew "asciinema"
# brew "aws-iam-authenticator"
brew "awscli"
brew "bash"
brew "bat"
brew "coreutils" # Those that come with macOS are outdated
brew "curl"
brew "docker-compose"
brew "doctl"
brew "dive"
brew "ffmpeg"
brew "gh"
brew "hub"
brew "git-extras"
brew "git"
brew "gnu-sed"
# brew "gnupg2" I could progabably get rid of this
brew "grep"
brew "helm"
brew "httpie"
brew "jq" # to pipe pretty json output from bash
brew "kubernetes-cli"
brew "mackup"
brew "masscan"
brew "minikube"
brew "ncdu"
# brew "pinentry-mac"
# brew "pinentry"
brew "potatolabs/git-redate/git-redate"
brew "restic"
brew "rsync"
brew "safe-rm"
brew "smartmontools"
brew "stow"
brew "the_silver_searcher" # https://gist.github.com/indiesquidge/ec010eca3ffa254788c2#brew-install-the_silver_searcher
brew "telnet"
brew "terraform"
brew "trash"
brew "tree"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zsh"

# Image
brew "advancecomp"
brew "apngasm"
brew "exiftool"
brew "gifsicle"
brew "graphicsmagick"
brew "guetzli"
brew "icoutils"
brew "imagemagick"
brew "imageworsener"
brew "jhead"
brew "jpeg"
brew "jpeg-archive"
brew "jpegoptim"
brew "jpegrescan"
brew "libbpg"
brew "mozjpeg"
brew "optipng"
brew "perceptualdiff"
brew "pngcheck"
brew "pngcrush"
brew "pngnq"
brew "pngquant"
brew "webp"

# Development
# brew "deno"
# brew "go"
# brew "hugo"
# brew "node"
# brew "php"
# brew "composer"
# brew "python"
# brew "ruby"
# brew "rust"
# brew "yarn"
# brew "fluxcd/tap/flux"
# brew "quicktype"
