# see https://github.com/Homebrew/homebrew-bundle
# see https://github.com/kevinpapst/mac-os-setup/blob/master/Brewfile
cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions" # for docker-edge
tap "potatolabs/git-redate"
# A CLI tool upgrading every outdated app installed by Homebrew Cask
# INFO: brew cu
tap 'buo/cask-upgrade'

# Setup Tools
brew "mas"
# brew "whalebrew"

# mas "Affinity Designer", id: 824171161
# mas "DaisyDisk", id: 411643860
# mas "LanScan", id: 472226235
# mas "Name Mangler", id: 603637384
# mas "Paprika Recipe Manager 3", id: 1303222628
# mas "Textual IRC Client", id: 1262957439
# mas "WireGuard", id: 1451685025
# mas "Xcode", id: 497799835

#meh
# mas "Time Sync", id: 404363161
# mas "Trello", id: 1278508951
# mas "Twitterrific", id: 1289378661
# mas "Deliveries", id: 924726344
# mas "Drawful 2", id: 1121426744
# mas "Giphy Capture", id: 668208984
# mas "iA Writer", id: 775737590
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541

# Brews
brew "asciinema"
# brew "aws-iam-authenticator"
brew "awscli"
brew "bash"
brew "bat"
brew "composer"
brew "coreutils" # Those that come with macOS are outdated
brew "curl"
brew "docker-compose"
brew "doctl"
brew "dive"
brew "ffmpeg"
brew "gh"
brew "hub"
brew "git-extras"
brew "git"
brew "gnu-sed"
# brew "gnupg2" I could progabably get rid of this
brew "grep"
brew "helm"
brew "httpie"
brew "jq" # to pipe pretty json output from bash
brew "kubernetes-cli"
brew "mackup"
brew "masscan"
brew "minikube"
brew "ncdu"
# brew "pinentry-mac"
# brew "pinentry"
brew "potatolabs/git-redate/git-redate"
brew "restic"
brew "rsync"
brew "safe-rm"
brew "smartmontools"
brew "stow"
brew "the_silver_searcher" # https://gist.github.com/indiesquidge/ec010eca3ffa254788c2#brew-install-the_silver_searcher
brew "telnet"
brew "terraform"
brew "trash"
brew "tree" # List directories in a tree structure
brew "tmux"
brew "vim"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zsh"

# Image
brew "advancecomp"
brew "apngasm"
brew "exiftool"
brew "gifsicle"
brew "graphicsmagick"
brew "guetzli"
brew "icoutils"
brew "imagemagick"
brew "imageworsener"
brew "jhead"
brew "jpeg"
brew "jpeg-archive"
brew "jpegoptim"
brew "jpegrescan"
brew "libbpg"
brew "mozjpeg"
brew "optipng"
brew "perceptualdiff"
brew "pngcheck"
brew "pngcrush"
brew "pngnq"
brew "pngquant"
brew "webp"

# Development
# brew "deno"
# brew "go"
# brew "hugo"
# brew "node"
# brew "php"
# brew "python"
# brew "ruby"
# brew "rust"
# brew "yarn"
brew "fluxcd/tap/flux"
# brew "quicktype"

# Casks
cask "1password"
cask "aerial" # screensaver showing the AppleTV aerial videos
# cask "airtable"
cask "alfred"
cask "appcleaner"
# cask "arduino"
# cask "aware"
cask "bartender"
cask "battle-net"
cask "beyond-compare"
cask "blender"
cask "brave-browser"
# cask "calibre"
cask "chromium"
cask "discord"
cask "docker"
# cask "docker-edge"
cask "dropbox"
# cask "fantastical"
cask "figma"
cask "firefox-developer-edition"
cask "firefox"
cask "font-lato"
cask "font-go"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "gimp"
cask "gitify"
cask "gmvault" # backup & restore gmail accounts
cask "godot"
cask "google-chrome"
cask "gpg-suite"
cask "handbrake"
cask "hey"
cask "iconjar"
cask "inkscape"
cask "iterm2"
cask "java" unless system "/usr/libexec/java_home --failfast"
# cask "jet"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keepingyouawake"
# cask "keybase"
# cask "kitematic"
# cask "kodi"
# cask "kube-forwarder"
cask "ledger-live"
cask "lens"
cask "libreoffice"
cask "little-snitch"
cask "macsvg"
cask "malwarebytes"
cask "microsoft-edge"
# cask "miro-formerly-realtimeboard"
cask "notion"
# cask "obs"
# cask "olive"
# cask "paw"
# cask "postgres"
cask "prisma-studio"
cask "rectangle"
cask "runjs"
# cask "rocket"
# cask "roku-remote-tool"
cask "safari-technology-preview"
cask "slack"
# cask "sony-ps4-remote-play"
cask "sourcetree"
cask "steam"
cask "sync"
cask "sublime-text"
cask "sublime-merge"
# cask "tableplus"
cask "telegram"
cask "the-unarchiver"
cask "tor-browser"
cask "transmission"
cask "transmit"
# cask "tunnelblick"
cask "tuple"
cask "ubersicht"
# cask "valentina-studio"
cask "virtualbox", force: true
cask "virtualbox-extension-pack"
# cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"

# cask "tunnelbear"
# cask "gitbook"
# cask "poedit"
# cask "macdown"
# cask "seashore" # simple image editing for everyone
# cask "krita" # patterns/texture maker, paint tool
# cask "paintbrush"

# ==== Quick Look Plugins ====
# @see https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "webpquicklook"
# cask "betterzipql"
cask "suspicious-package" # http://www.mothersruin.com/software/SuspiciousPackage/
